posts/counting-occurencies.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt_BR" xml:lang="pt_BR">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Contando Ocorrências de Números em C, C++ e Common Lisp</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="description" content="Programming, Tech, and occasional rant space by Lucas Vieira" />
<meta name="generator" content="Org Mode" />
<!-- Google tag (gtag.js) -->
<link rel="stylesheet" type="text/css" href="/css/main.css" />
<link rel="stylesheet" type="text/css" href="/css/syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="/css/dark-theme.css" />
<link rel="icon" type="image/jpg" href="/img/cat-i-mage.jpg" />
<link rel="alternate" type="application/atom+xml" title="The Alchemist's Hideout" href="/feed.xml" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta name="theme-color" content="#14171e">
<link rel="stylesheet" href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.4.0/css/all.min.css">
<meta property="og:url" content="https://luksamuk.codes/posts/counting-occurencies.html">
<meta property="og:type" content="article">
<meta property="og:title" content="Contando Ocorrências de Números em C, C++ e Common Lisp">
<meta property="og:description" content="Programming, Tech, and occasional rant space by Lucas Vieira">
<meta property="og:image" content="https://luksamuk.codes/img/banner-full.png">
<meta property="article:author" content="Lucas S. Vieira">
<meta name="twitter:card" content="summary_large_image">
<meta name="twitter:domain" content="luksamuk.codes">
<meta name="twitter:url" content="https://luksamuk.codes/posts/counting-occurencies.html">
<meta name="twitter:title" content="Contando Ocorrências de Números em C, C++ e Common Lisp">
<meta name="twitter:description" content="Programming, Tech, and occasional rant space by Lucas Vieira">
<meta name="twitter:image" content="https://luksamuk.codes/img/banner-full.png">
</head>
<body>
<div id="preamble" class="status">
<div id="nav-wrapper"><nav id="site-nav"><a href="/"><i class="fa-solid fa-house"></i> Home</a> <a href="/pages/about.html"><i class="fa-solid fa-user"></i> About</a> <a href="/pages/games.html"><i class="fa-solid fa-gamepad"></i> Games</a> <a href="/pages/portfolio.html"><i class="fa-solid fa-briefcase"></i> Portfolio</a> <a href="/pages/learn.html"><i class="fa-solid fa-book-open"></i> Learn</a> <a href="/pages/talks-index.html"><i class="fa-solid fa-chalkboard-user"></i> Talks</a> <a href="/pages/blog.html"><i class="fa-solid fa-rss"></i> Blog</a> <button id="theme-selector" onclick="toggleTheme()"><i class="fa-solid fa-moon"></i></button></nav><h1 class="site-title"><a href="/">The Alchemist's Hideout</a></h1></div><h1 class="title">Contando Ocorrências de Números em C, C++ e Common Lisp</h1><p><i>Escrito em Dec 18, 2018 por Lucas S. Vieira</i></p>
</div>
<div id="content" class="content">
<div id="outline-container-org7968dc8" class="outline-2">
<h2 id="org7968dc8">Introdução</h2>
<div class="outline-text-2" id="text-org7968dc8">
<p>
Mais uma vez, deparei-me com mais uma situação em que precisei explicar para
colegas a respeito de algum conceito de programação que não era muito
trivial. Desta vez, trata-se de um exercício de programação onde, dada uma
entrada de <code>n</code> números, que podem ser diferentes ou não, precisamos contar as
ocorrências de cada uma e imprimi-las na tela.
</p>

<p>
Existem várias formas de resolver este problema, provavelmente até mesmo sem
armazenar absolutamente nada extra memória. Um dos meus colegas, inclusive,
encontrou uma maneira bem interessante, envolvendo ordenar os números; o fato de
estarem agrupados sinalizaria apenas a necessidade de contá-los e exibir o
resultado na tela, a cada grupo.
</p>

<p>
Mas por que vamos facilitar, se podemos complicar? <code>:D</code>
</p>

<p>
Neste artigo, pretendo explorar três formas diferentes de resolver o problema: a
primeira em <code>C</code>, muito parecida com o que fiz no momento de resolução do
exercício; a segunda, em <code>C++</code>, tirando o máximo proveito da <code>STL</code>; e a terceira, em
<code>Common Lisp</code>, para efeitos comparativos.
</p>
</div>
<div id="outline-container-orgc43cc1c" class="outline-4">
<h4 id="orgc43cc1c"><b>ACHTUNG!</b></h4>
<div class="outline-text-4" id="text-orgc43cc1c">
<p>
Por motivos didáticos, omitirei a função <code>main</code> em <code>C</code> e <code>C++</code>, mas deixarei
explícitos os cabeçalhos utilizados. Ciente disto, adapte o código à sua
necessidade, caso queira executá-lo. No caso de <code>Common Lisp</code>, copiar o código
apresentado, na sequência mostrada, em um arquivo <code>.lisp</code>, será o suficiente para
executá-lo.
</p>
</div>
</div>
</div>
<div id="outline-container-org6ddce28" class="outline-2">
<h2 id="org6ddce28">Solução em <code>C</code></h2>
<div class="outline-text-2" id="text-org6ddce28">
<p>
A ideia principal para resolver este problema em <code>C</code> é criar uma estrutura de
dados capaz de armazenar repetições para cada número; ou seja, uma forma de
<b>mapear</b> cada número, como uma <i>chave</i>, para seu respectivo número de
repetições.
</p>

<p>
Primeiramente, precisamos de um <code>struct</code> que represente este mapeamento <code>número =&gt;
repetição</code>. Digamos, também, que vamos receber dez números, que iremos armazenar
em um vetor simples.
</p>

<div class="org-src-container">
<pre class="src src-C"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdio.h&gt;</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Estrutura representando as repeti&#231;&#245;es para um n&#250;mero
</span><span class="org-keyword">typedef</span> <span class="org-keyword">struct</span> {
    <span class="org-type">int</span> <span class="org-variable-name">num</span>;
    <span class="org-type">int</span> <span class="org-variable-name">rep</span>;
} <span class="org-type">repetition_t</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Vetor de n&#250;meros a serem recebidos
</span><span class="org-type">int</span> <span class="org-variable-name">numbers</span>[10];

<span class="org-comment-delimiter">// </span><span class="org-comment">Entradas
</span>{
    <span class="org-type">int</span> <span class="org-variable-name">i</span>;
    <span class="org-keyword">for</span>(i = 0; i &lt; 10; i++) {
        scanf(<span class="org-string">"%d"</span>, &amp;numbers[i]);
    }
}
</pre>
</div>

<p>
Agora, vamos analisar o que faremos a seguir. Sabemos que temos que contar
números repetidos. No pior dos casos, pode ocorrer de <b>os dez números serem
diferentes</b>. Nesta situação, teremos dez entradas de repetições diferentes.
</p>

<p>
Sendo assim, podemos nomear um vetor baseado no máximo de repetições possíveis,
e um contador para as repetições já registradas:
</p>

<div class="org-src-container">
<pre class="src src-C"><span class="org-type">int</span>          <span class="org-variable-name">num_repetitions</span> = 0;
<span class="org-type">repetition_t</span> <span class="org-variable-name">repetitions</span>[10];
</pre>
</div>

<p>
Podemos, agora, percorrer o vetor de números. Para cada número no vetor,
verificamos se já há uma entrada registrada para ele no nosso vetor de
repetições.
</p>

<p>
Se há uma repetição registrada, apenas incrementamo-na. Se não, incrementamos o
número de repetições registradas, e criamos uma nova entrada, começando a contar
o número de repetições a partir de <code>1</code>:
</p>

<div class="org-src-container">
<pre class="src src-C"><span class="org-type">int</span> <span class="org-variable-name">i</span>, <span class="org-variable-name">j</span>;
<span class="org-keyword">for</span>(i = 0; i &lt; 10; i++) {
    <span class="org-type">int</span> <span class="org-variable-name">entry_found</span> = 0;
    <span class="org-keyword">for</span>(j = 0; j &lt; num_repetitions; j++) {
        <span class="org-keyword">if</span>(numbers[i] == repetitions[j].num) {
            entry_found = 1;
            repetitions[j].rep++;
            <span class="org-keyword">break</span>;
        }
    }
    <span class="org-keyword">if</span>(<span class="org-negation-char">!</span>entry_found) {
        repetitions[num_repetitions].num = numbers[i];
        repetitions[num_repetitions].rep = 1;
        num_repetitions++;
    }
}
</pre>
</div>

<p>
Depois disso, tudo o que nos resta é iterar sobre as repetições registradas,
imprimindo o número e a quantidade de repetições registradas para ele.
</p>

<div class="org-src-container">
<pre class="src src-C"><span class="org-keyword">for</span>(i = 0; i &lt; num_repetitions; i++) {
    printf(<span class="org-string">"%d =&gt; %d\n"</span>,
           repetitions[i].num, repetitions[i].rep);
}
</pre>
</div>

<p>
Teremos a seguinte interação no console:
</p>

<div class="org-src-container">
<pre class="src src-bash">% g++ find_numbers.c 
% ./a.out 
1 1 1 3 5 5 7 8 9 9
1 =&gt; 3
3 =&gt; 1
5 =&gt; 2
7 =&gt; 1
8 =&gt; 1
9 =&gt; 2
</pre>
</div>
</div>
</div>
<div id="outline-container-org7a5169f" class="outline-2">
<h2 id="org7a5169f">Solução em <code>C++</code></h2>
<div class="outline-text-2" id="text-org7a5169f">
<p>
Vamos ser honestos. Tudo o que fiz em <code>C</code> foi emular, de forma ineficiente (para
um caso com mais números), uma estrutura que conhecemos bem em <code>C++</code>: um
<code>std::map</code>. E é exatamente por isso que, ao invés de tentarmos emulá-la novamente,
usaremos o que a linguagem tem a nos oferecer como algo pré-implementado.
</p>

<p>
Vamos começar da mesma forma: declarando o que é necessário para registrar as
repetições. Teremos nosso vetor de dez números, e um <code>std::map</code> registrando as
repetições.
</p>

<div class="org-src-container">
<pre class="src src-C++"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;iostream&gt;</span>
<span class="org-preprocessor">#include</span> <span class="org-string">&lt;map&gt;</span>

<span class="org-comment-delimiter">// </span><span class="org-comment">Declara&#231;&#245;es
</span><span class="org-type">int</span> <span class="org-variable-name">numbers</span>[10];
<span class="org-constant">std</span>::<span class="org-type">map</span>&lt;<span class="org-type">int</span>, <span class="org-type">int</span>&gt; <span class="org-variable-name">repetitions</span>;

<span class="org-comment-delimiter">// </span><span class="org-comment">Entrada
</span><span class="org-keyword">for</span>(<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; 10; i++) {
    <span class="org-constant">std</span>::cin &gt;&gt; numbers[i];
}
</pre>
</div>

<p>
Agora, iteramos sobre os números. Da mesma forma, verificamos se já os
registramos; se sim, é só uma questão de incrementá-los. Se não, basta criarmos
a chave e realizarmos a primeira atribuição para aquele número.
</p>

<p>
<b>ERRATA:</b> Na realidade, não é necessário verificar se a chave já está registrada,
em um <code>std::map</code>! Basta realizar a incrementação, uma vez que <code>C++</code> inicializa as
chaves com o valor nulo do tipo, ou seja, neste caso, com <code>0</code>. Obrigado ao Paulo
Alvarenga por apontar isso para mim via Facebook.
</p>

<div class="org-src-container">
<pre class="src src-C++"><span class="org-keyword">for</span>(<span class="org-type">int</span> <span class="org-variable-name">i</span> = 0; i &lt; 10; i++) {
    repetitions[numbers[i]]++;
}
</pre>
</div>

<p>
Por fim, iteramos sobre o mapa e imprimimos a mesma relação de chave para
repetição. Mas faremos isto com uma sintaxe limpa, baseada em <code>C++11</code>:
</p>

<div class="org-src-container">
<pre class="src src-C++"><span class="org-keyword">for</span>(<span class="org-keyword">auto</span>&amp; <span class="org-variable-name">pair</span> : repetitions) {
    <span class="org-constant">std</span>::cout &lt;&lt; pair.first &lt;&lt; <span class="org-string">" =&gt; "</span> &lt;&lt; pair.second &lt;&lt; <span class="org-constant">std</span>::endl;
}
</pre>
</div>

<p>
Eis a interação no console.
</p>

<div class="org-src-container">
<pre class="src src-bash">% g++ --std=c++11 find_numbers.cpp 
% ./a.out 
1 1 1 3 5 5 7 8 9 9
1 =&gt; 3
3 =&gt; 1
5 =&gt; 2
7 =&gt; 1
8 =&gt; 1
9 =&gt; 2
</pre>
</div>
</div>
</div>
<div id="outline-container-org81230f8" class="outline-2">
<h2 id="org81230f8">Solução em <code>Common Lisp</code></h2>
<div class="outline-text-2" id="text-org81230f8">
<p>
<code>Common Lisp</code> é uma linguagem madura. Em termos de recursos esperados por um
programador, digamos, no caso de contêineres, ela não decepciona. Assim como em
<code>C</code> e <code>C++</code>, há um enorme número de maneiras para resolver nosso
problema. Ao invés de escolher uma maneira mais "esperta", vou adequar a solução
em <code>CL</code> às outras soluções: armazenar os números, criar um mapa e estabelecer uma
relação entre chave e número de repetições.
</p>

<p>
Começaremos criando uma lista de números &#x2013; que equivale a um átomo de nulidade
&#x2013;, e também criando a nossa estrutura que armazenará a relação
chave/repetições: Uma <code>Hash Table</code>.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">defparameter</span> <span class="org-variable-name">*numbers*</span> nil)
(<span class="org-keyword">defparameter</span> <span class="org-variable-name">*repetitions*</span> (make-hash-table))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Entrada
</span>(<span class="org-keyword">dotimes</span> (i 10)
  (push (read) *numbers*))
</pre>
</div>

<p>
Uma coisa interessante a notar é que os números serão lidos na ordem inversa aos
casos anteriores: como estamos utilizando uma lista para armazenar nossos
números, a função <code>push</code> modificará <code>*numbers*</code>, colocando o número diretamente na
frente da lista.
</p>

<p>
Nosso próximo passo é iterar sobre cada um dos elementos e verificar se eles
são chaves da <code>hash table</code>, como fizemos nos outros exemplos. Se sim,
incrementamos o elemento; se não, definimo-no pela primeira vez com um valor <code>1</code>.
</p>

<div class="org-src-container">
<pre class="src src-lisp">(<span class="org-keyword">loop</span> for x in *numbers*
   if (gethash x *repetitions*)
   do (incf (gethash x *repetitions*))
   else do (setf (gethash x *repetitions*) 1))
</pre>
</div>

<p>
Este comando pode parecer um complicado à primeira vista, então vou me esforçar
para explicá-lo mais um pouco.
</p>

<p>
Este é o famigerado macro <code>loop</code>. Alguns lispeiros não gostam muito dele porque,
muitas vezes, utilizar este macro também implica utilizar praticamente uma
linguagem diferente de <code>Common Lisp</code>, própria para ser usada dentro deste
macro. Estou utilizando ele exatamente para evitar um uso extra de estruturas de
controle de fluxo.
</p>

<p>
A instrução <code>(gethash chave hash-table)</code>, assim como em <code>C++</code>, funciona como uma
forma tanto de recuperar quanto atribuir um valor a uma chave qualquer. Se a
chave não existir na <code>Hash Table</code>, esta instrução retorna <code>nil</code>, equivalente a
falso; se existir, ela retorna o valor associado, tratado como verdadeiro. <code>(incf
variável)</code> é uma instrução que incrementa diretamente o valor associado à chave,
quando aplicado a <code>(gethash ...)</code>. Já <code>(setf variável valor)</code>, independente de a
chave já existir no <code>Hash Table</code> ou não, realiza uma atribuição de um valor a uma
chave.
</p>

<p>
Como você pode ver pela minha descrição, isto em nada difere do que fizemos em
<code>C++</code>; a única diferença é a sintaxe e a estrutura em si, que funcionam
praticamente da mesma forma.
</p>

<p>
Para finalizar, iteramos sobre nosso <code>Hash Table</code>, imprimindo as relações. Para
tanto, não utilizaremos um <code>loop</code> explícito, mas sim a função <code>maphash</code>: ela é
responsável por chamar uma função que indicarmos para cada par <code>(chave, valor)</code> no
mapa:
</p>

<div class="org-src-container">
<pre class="src src-lisp">(maphash (<span class="org-keyword">lambda</span> (key value)
           (format t <span class="org-string">"~a =&gt; ~a~%"</span> key value))
         *repetitions*)
</pre>
</div>


<p>
Podemos executar o código como script, utilizando o <code>Steel Bank Common Lisp</code>:
</p>

<div class="org-src-container">
<pre class="src src-bash">% sbcl --script find-numbers.lisp --no-linedit
1 1 1 3 5 5 7 8 9 9
9 =&gt; 2
8 =&gt; 1
7 =&gt; 1
5 =&gt; 2
3 =&gt; 1
1 =&gt; 3
</pre>
</div>
</div>
</div>
<div id="outline-container-org35569f4" class="outline-2">
<h2 id="org35569f4">Conclusão</h2>
<div class="outline-text-2" id="text-org35569f4">
<p>
Como você pode ver, não importa a linguagem que você venha a utilizar; você será
capaz de resolver problemas simples como este. Mas acredito que seja
interessante observar o problema sendo resolvido da mesma forma, em várias
linguagens. Esta aproximação cria uma espécie de <i>pedra-de-roseta</i>, algo que
poderia servir para o aprendizado de várias linguagens, ainda que não
representem a forma de resolver o problema com a melhor performance.
</p>

<p>
Como dica para você, deixo a seu cargo reimplementar este ou outro problema que
tenha resolvido, em uma linguagem diferente da inicial, ou até mesmo com outra
estratégia diferente da mais óbvia. Uma mudança de perspectiva pode significar
uma nova forma de explorar seu próprio raciocínio lógico.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<h3><a href="/pages/blog.html">&#8592; Voltar ao Blog</a></h3><p style="font-size: 0.85em; color: #888; margin-top: 1em; padding: 0.5em; border-left: 3px solid #555;">Os comentários foram desativados em razão da <a href="https://www.planalto.gov.br/ccivil_03/_ato2023-2026/2025/lei/L15211.htm" style="color: #888; text-decoration: underline;">Lei 15.211/2025</a> (ECA Digital, "Lei Felca"). A legislação impõe exigências de moderação que inviabilizam recursos interativos em sites pessoais sem estrutura para tanto.</p>
</div>
</body>
</html>
